app/controllers/polls_controller.rb

SELECT * FROM "polls" WHERE ("polls"."id" = 1)
SELECT * FROM "choices" WHERE ("choices".poll_id = 1)
---
  def show
    @poll = Poll.find(params[:id])
    @choices = (params[:sort])? @poll.choices.sort! { |a,b| b.votes <=> a.votes } : @poll.choices
    @categories = @poll.choices.map(&:name)

SELECT * FROM "polls" WHERE ("polls"."id" = 1)
---
  def edit
    @poll = Poll.find(params[:id])

INSERT INTO "polls" ("score", "updated_at", "title", "url", "created_at") VALUES(NULL, '2009-12-29 06:10:44', NULL, 'http://news.ycombinator.com/item?id=517039', '2009-12-29 06:10:44')
---
  def create
    @poll = Poll.new(params[:poll])

    respond_to do |format|
      if @poll.save

SELECT * FROM "polls" WHERE ("polls"."id" = 1)
UPDATE "polls" SET "score" = 0, "updated_at" = '2009-12-29 06:38:53' WHERE "id" = 1
---
  def update
    @poll = Poll.find(params[:id])
    respond_to do |format|
      if @poll.updated_at < 10.minutes.ago